{
	"description" : {
		"text": {
			"fr": "Hey,<br />Je suis Edouard, nouvellement diplômé d'un master en sécurité informatique. J'aime apprendre de nouvelles choses, notamment sur les domaines du développement logiciel, de la recherche de vulnérabilité ainsi que de la sécurité des systèmes. J'aime toute sorte de challenges : de l'informatique jusqu'au longboard longue distance. Vous pouvez me retrouver sur <a href=\"https://github.com/edznux/\">Github</a> ou <a href=\"https://twitter.com/edznux/\">Twitter</a>.",
			"en": "Hi, I'm Edouard.<br /> I'm a French security guy just graduated from a master's degree. Interested in learning things, I set my focus around software development, exploitation and system security. I like all kind of challenges: from computers to long distance longboarding. You can find me on <a href=\"https://github.com/edznux/\">Github</a> or <a href=\"https://twitter.com/edznux/\">Twitter</a>."
		}
	},
	"info" : {
		"text": {
			"fr":"Avec un attrait particulier vers la sécurité offensive, j'ai obtenu mon master en Sécurité Informatique en 2018 à l'université de la Sorbonne à Paris.<br /> Toujours à l'affut de nouvelles connaissances, je m'essaie à différents challenges et projets.<br />Créatif et curieux de nature, j'aime construire des choses pour mieux comprendre leurs fonctionnements.<br />Partisan de la sécurité pour tous, j'apprécie les outils simples, robustes et accessibles plus que des outils réservés à l'élite. Certains de mes outils sont disponibles sur Github.<br />Aimant les challenges, en octobre 2018 je me suis lancé dans un voyage solitaire en longboard longue distance de Bruxelles jusqu'à Amsterdam.",
			"en":"Nerd with an attraction towards offensive security, I completed my master degree in Information Security (\"Master Sécurité Informatique\") in 2018 at the Sorbonne University.<br />I try to keep my skills sharp and learn new ones with several infosec projects and challenges.<br />Creative and curious by nature, I like building tools to get a better understanding on how things works.<br />Supporter of useable security I prefer simple and polished tools useable by anyone to l33t reserved ones.<br />I'm building some tools, some of them available on <a href=\"https://github.com/edznux/\">Github</a>.<br />In fall 2018, I challenged myself to do a long-distance longboarding solo trip from Brussels to Amsterdam."
		}
	},
	"projets" : [
		{
			"id": "netm4ul",
			"title": "Netm4ul",
			"date": 2018,
			"buttons": {
				"github": "https://github.com/netm4ul/netm4ul"
			},
			"description": {
				"fr": "Outil de reconnaissance et de test d'intrusions distribué et automatisé",
				"en": "Automated distributed recon & pentest tool"
			},
			"tags": [
				"golang",
				"postgres",
				"mongodb",
				"docker"
			]
		},
		{
			"id": "netm4ul-frontend",
			"title": "Netm4ul WebUI",
			"date": 2018,
			"buttons": {
				"github": "https://github.com/netm4ul/webui"
			},
			"description": {
				"fr": "Outil de reconnaissance et de test d'intrusions distribué et automatisé",
				"en": "Web user interface for the Netm4ul recon tool."
			},
			"tags": [
				"vuejs",
				"javascript",
				"docker",
				"frontend"
			]
		},
		{
			"id":"hubot-ethereum",
			"title":"Hubot-ethereum", 
			"date": 2016,
			"buttons": {
				"github" : "https://github.com/edznux/hubot-ethereum"
			},
			"description" : {
				"fr": "Robot textuel basé sur hubot. Il permet de récupérer des informations avancées sur le réseau Ethereum. Disponible sous forme de paquet npm (<a href=\"https://www.npmjs.com/package/hubot-ethereum\">hubot-ethereum</a>)",
				"en": "Chat bot for ethereum blockchain using the Hubot framework"
			},
			"tags" : ["nodejs", "ethereum", "redis"]
		},
		{
			"id": "go2seccomp",
			"title": "go2seccomp",
			"date": 2018,
			"buttons": {
				"github": "https://github.com/xfernando/go2seccomp"
			},
			"description": {
				"fr": "J'ai pu aider au développement d'un outil de génération de profils Seccomp automatique sur des binaires Go",
				"en": "Automated seccomp profile's generator for Go binaries: I added support for ARM and x86 architectures"
			},
			"tags": [
				"golang",
				"docker"
			]
		},
		{
			"id":"site",
			"title":"edouard.schweisguth.fr",
			"date":2016,
			"buttons":{
				"github": "https://github.com/edznux/edouard.schweisguth.fr",
				"demo":"https://edouard.schweisguth.fr/"
			},
			"description" : {
				"fr": "Site vitrine que vous visitez actuellement. Disponible en Https grâce à Let's Encrypt, utilise AngularJS.",
				"en": "This portfolio website. It uses AngularJS for the frontend, Let's Encrypt and Nginx on Docker."
			},
			"tags" : ["nginx", "angular", "frontend"]
		}

	],
	"contact":{
		"blockchain":[
			]
	},
	"tags": {
		"nodejs":{
			"title":"Node JS",
			"link": "https://nodejs.org/"
		},
		"javascript": {
			"title": "Javascript"
		},
		"vuejs": {
			"title": "Vue JS",
			"link":"http://vuejs.org/"
		},
		"mongodb":{
			"title":"MongoDB",
			"link":"https://www.mongodb.com"
		},
		"docker": {
			"title": "Docker",
			"link": "https://docker.com"
		},
		"redis":{
			"tile":"Redis",
			"link":"https://redis.io"
		},
		"angular":{
			"title":"Angular JS",
			"link":"https://angularjs.org/"
		},
		"mysql":{
			"title":"MySQL",
			"link":"https://www.mysql.com/"
		},
		"postgres":{
			"title":"PostgreSQL",
			"link":"https://www.postgresql.org/"
		},
		"nginx":{
			"title":"NGINX",
			"link":"https://nginx.org/"
		},
		"ethereum":{
			"title":"Ethereum",
			"link":"https://ethereum.org"
		},
		"bitcoin":{
			"title":"Bitcoin",
			"link":"https://bitcoin.org"
		},
		"golang":{
			"title": "Go",
			"link":"https://golang.org"
		}
	}
}
